backend_sales/stress-test.yml
config:
  target: 'http://localhost:4000/graphql'
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - name: GraphQL stress test
    flow:
      - post:
          url: '/'
          json:
            query: |
              query {
                getArticles {
                  id
                  title
                  content
                }
              }